### Series

In [1]:
# Series는 생성시 인덱스를 지정하지 않으면 정수형 인덱스가 자동 생성된다.
# Series는 생성시 인덱스로 문자열을 지정하여 사용할 수 있다.

In [9]:
import pandas as pd

In [10]:
s = pd.Series(['banana', 42])
print(s)

0    banana
1        42
dtype: object

In [3]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], index=['Person', 'Who'])
print(s)

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [5]:
scientists = pd.DataFrame({ 
    'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]}) 

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [7]:
from collections import OrderedDict #순서보장 딕셔너리

In [8]:
scientists = pd.DataFrame(OrderedDict([ 
    ('Name', ['Rosaline Franklin', 'William Gosset']),
    ('Occupation', ['Chemist', 'Statistician']), 
    ('Born', ['1920-07-25', '1876-06-13']), 
    ('Died', ['1958-04-16', '1937-10-16']), 
    ('Age', [37, 61])
])
) 

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [11]:
scientists = pd.DataFrame( 
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Age', 'Died'])  #columns 열 순서가 유지된다.

scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [12]:
#scientists
 
first_row = scientists.loc['William Gosset'] 
print(type(first_row))

<class 'pandas.core.series.Series'>

In [13]:
print(first_row) #시리즈 출력  age 데이터 타입 object

Occupation    Statistician
Born            1876-06-13
Age                     61
Died            1937-10-16
Name: William Gosset, dtype: object

In [14]:
first_row.index

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [15]:
first_row.index[0]

'Occupation'

In [16]:
first_row.values

array(['Statistician', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [17]:
first_row.keys()

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [18]:
first_row.keys()[0]

'Occupation'

In [20]:
# 시리즈의 기초 통계 메서드 사용하기

ages = scientists['Age'] 
print(ages)

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [21]:
print(ages.mean())

49.0

In [22]:
print(ages.min())

37

In [23]:
print(ages.max())

61

In [24]:
print(ages.std()) #표준편차

16.97056274847714

In [25]:
#시리즈와 불린 추출 - 데이터 추출시 인덱스를 지정하여 추출한다. 그러나 추출할 데이터의 인덱스를 모르는 경우 사용하는 방법이 불린 추출이다.

scientists = pd.read_csv('data2/scientists.csv')
ages = scientists['Age'] 
 
print(ages.max())
print(ages.mean())

90
59.125

In [26]:
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [27]:
ages[ages > ages.mean()] #불린추출

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [28]:
# 시리즈와 브로드캐스팅(Broadcasting)
'''
- 브로드캐스팅 : 시리즈나 데이터프레임에 있는 모든 데이터에 대해 한 번에
  연산을 하는 것을 말한다.
- 백터 : 시리즈 처럼 여러개의 값을 가진 데이터를 백터라 한다.
- 스칼라 : 단순 크기를 나타내는 데이터를 스칼라 한다.
'''

'\n- 브로드캐스팅 : 시리즈나 데이터프레임에 있는 모든 데이터에 대해 한 번에\n  연산을 하는 것을 말한다.\n- 백터 : 시리즈 처럼 여러개의 값을 가진 데이터를 백터라 한다.\n- 스칼라 : 단순 크기를 나타내는 데이터를 스칼라 한다.\n'

In [29]:
print(ages + ages) #백터 + 백터, 시리즈는 백터의 한 종류이다.
print(ages * ages) #백터 * 백터

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [30]:
print(ages + 100) #백터 + 스칼라
print(ages * 100) #백터 * 스칼라

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64
0    3700
1    6100
2    9000
3    6600
4    5600
5    4500
6    4100
7    7700
Name: Age, dtype: int64

In [31]:
print(pd.Series([1, 100])) #1,100을 가진 시리즈 생성

0      1
1    100
dtype: int64

In [32]:
print(ages + pd.Series([1, 100])) #길이가 다른 두 시리즈 더하기

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [33]:
ages.sort_index()

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [34]:
ages.sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

### DataFrame

In [35]:
# 데이터프레임도 시리즈와 마찬가지로 불린 추출과 브로드캐스팅을 할 수 있다.

In [38]:
# 불린 추출
# Age열에서 Age열의 평균보다 높은 행만 출력한다.
 
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [39]:
#인덱스가 True인 데이터만 추출
scientists.loc[[True, True, False, True, True, False,True,True]]

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1     William Gosset  1876-06-13  1937-10-16   61        Statistician
3        Marie Curie  1867-11-07  1934-07-04   66             Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7       Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [40]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

### Series와 DataFrame의 데이터 처리

In [41]:
print(scientists['Born'].dtype) # dtype자료형 확인
print(scientists['Died'].dtype)

object
object

In [42]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d') 
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [43]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [44]:
(scientists['born_dt'], scientists['died_dt'] )= (born_datetime, died_datetime)
print(scientists.head())

                   Name        Born        Died  Age    Occupation    born_dt  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

     died_dt
0 1958-04-16
1 1937-10-16
2 1910-08-13
3 1934-07-04
4 1964-04-14

In [45]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt'], dtype='object')

In [46]:
scientists_dropped = scientists.drop(['Age'], axis=1)
 
print(scientists_dropped.columns)

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt'], dtype='object')

In [47]:
print(scientists.index) #인덱스 확인

RangeIndex(start=0, stop=8, step=1)

In [48]:
scientists_dropped

,Name,Born,Died,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23

### 데이터 저장하고 불러오기

In [49]:
names = scientists['Name'] 
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [52]:
names.to_pickle('files/scientists_names_series.pickle') #시리즈 피클로저장

In [53]:
scientist_names_from_pickle = pd.read_pickle('files/scientists_names_series.pickle')
print(scientist_names_from_pickle) #피클 시리즈 읽어와서 출력

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [54]:
scientists.to_pickle('files/scientists_df.pickle') #데이터프레임 피클로저장
scientists_from_pickle = pd.read_pickle('files/scientists_df.pickle')
print(scientists_from_pickle) #피클 데이터프레임 읽어와서 출력

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt
0 1920-07-25 1958-04-16
1 1876-06-13 1937-10-16
2 1820-05-12 1910-08-13
3 1867-11-07 1934-07-04
4 1907-05-27 1964-04-14
5 1813-03-15 1858-06-16
6 1912-06-23 1954-06-07
7 1777-04-30 1855-02-23

In [55]:
names.to_csv('files/scientist_names_series.csv') #csv 로 저장
 
scientists.to_csv('files/scientists_df.tsv', sep='\t') #tsv 저장
 
scientists.to_csv('files/scientists_df_no_index.csv', index=False) #index는 저장안함

In [56]:
names_df = names.to_frame()
 
import xlwt 
names_df.to_excel('files/scientists_names_series_df.xls')
 
import openpyxl 
names_df.to_excel('files/scientists_names_series_df.xlsx')

C:\ProgramData\Anaconda3\envs\pydata\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  after removing the cwd from sys.path.